{"meta":{"title":"Jing'AoTechnology","subtitle":"Jing'AoTechnology","description":"At Jing'AoTechnology, we create software that enhances everyday life.","author":"Jing'AoTechnology","url":"http://allensucre.github.io","root":"/"},"pages":[{"title":"contact","date":"2020-02-22T03:54:46.000Z","updated":"2020-02-22T03:54:46.000Z","comments":true,"path":"contact/index.html","permalink":"http://allensucre.github.io/contact/index.html","excerpt":"","text":"document.querySelectorAll('.github-emoji') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });"},{"title":"categories","date":"2020-02-22T03:52:05.000Z","updated":"2020-02-22T03:52:05.000Z","comments":true,"path":"categories/index.html","permalink":"http://allensucre.github.io/categories/index.html","excerpt":"","text":"document.querySelectorAll('.github-emoji') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });"},{"title":"tags","date":"2020-02-22T03:53:26.000Z","updated":"2020-02-22T03:53:26.000Z","comments":true,"path":"tags/index.html","permalink":"http://allensucre.github.io/tags/index.html","excerpt":"","text":"document.querySelectorAll('.github-emoji') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });"}],"posts":[{"title":"Privacy & Legal","slug":" GeoProof Privacy&Legal","date":"2024-12-23T06:49:36.000Z","updated":"2024-12-23T06:49:36.000Z","comments":true,"path":"2024/12/23/geoproof-privacy-legal/","link":"","permalink":"http://allensucre.github.io/2024/12/23/geoproof-privacy-legal/","excerpt":"","text":"GeoProof Camera Privacy &amp; LegalUpdated: May 30, 2024 Effective date: May 30, 2024 GeoProof Camera IntroductionWelcome to the GeoProof Camera APP! We will help you understand our collection, use, storage and sharing of personal information through the Privacy Protection Guidelines, as well as your rights. GeoProof Camera takes user privacy very seriously. When you use our services, we may collect and use information about you. We would like to use this Privacy Protection Guide to explain to you how we collect, use, store and share this information when using our services, and how we provide you with access to, update, control and protect this information. This guide is closely related to the engraving time APP service you use, I hope you read it carefully, and make the choice you think appropriate in accordance with this guide when necessary. By using or continuing to use our Services, you consent to the collection, use, storage and sharing of your information in accordance with this Privacy Protection Guideline. This privacy guide will help you understand the following: Collection of personal information ** Storage of information 3, information security 4, How do we use information 5, external provide 6, Your rights 7, change Protection of minors 9, other 10, Contact us 1. Information we collectSculpting Time app is a photo application. In the process of your use of the Sculpting Time app service, we will collect the information you proactively provide when using the service or generated because of the use of the service in the following ways to provide you with services, optimize our services and protect your account security: When you use the Engraving app service, in order to protect your normal use of our service, maintain the normal operation of our service, improve and optimize our service experience, and protect the security of your account, we will collect your device model, unique device identifier (AndroidID), application list, Used to identify you as a GeoProof Camera app user and protect business security. In order to ensure your normal use of our services, maintain the normal operation of our services, improve and optimize your service experience, and ensure the security of your account, we will collect your device model, operating system, unique device identifier, login IP address, operation log, SSID, BSSID, network information, device SN and other information. To prevent your data from being frequently invoked, we collect your SDK or API version, platform, timestamp, application identifier, application version, terminal manufacturer, terminal device operating system version, local language, time zone, network status (Wi-Fi status, etc.), and network log information to ensure the minimum use of your information. We or our third-party partners may collect your information through cookies, identifiers and related technologies, including your device information, browsing information, and click information, and store such information as log information to provide you with a quality user experience and ensure the security of the service. You can disable or manage the use of cookies, identifiers, or related technologies by setting them. At the same time, in order to ensure the stable operation of the GeoProof Camera app or achieve relevant functions, we may access software development kits (SDKS) provided by third parties to achieve the above purposes. GeoProof Camera app access to third party SDK directory/see this link (https://www.notion.so/15b890eb9b7c80b7b19cc6847c3307d0?pvs=21). When you use iOS devices to take photos or shoot videos, we will ask you to authorize ** camera permissions, microphone permissions, album permissions *, in order to provide you with picture and video shooting, sound recording, picture and video reading, save and other functions. In order to provide you with better services and content, we will track your activities on other companies’ apps and websites with your consent. You can turn off the above permissions at any time. When you use your Android device, we do not use your camera permissions * and microphone permissions . In addition, according to relevant laws and regulations and national standards, we may collect and use your relevant personal information without seeking your authorization and consent under the following circumstances: Directly related to national security, national defense security and other national interests; Directly related to public security, public health, public knowledge and other major public interests; Directly related to criminal investigation, prosecution, trial and enforcement of sentences; For the protection of your or other individuals’ life, property, reputation and other major legitimate rights and interests, but it is difficult to get the consent of the person; The personal information collected is disclosed to the public by you; Collecting personal information from legally publicly disclosed information, such as legal news reports, government information disclosure and other channels; Necessary for the conclusion and performance of the contract at your request; Necessary to maintain the safe and stable operation of the products or services provided, such as detecting and disposing of faults of the products or services; necessary for the conduct of legitimate journalism; When statistical or academic research is necessary in the public interest, and the results of academic research or description are provided to the public, the personal information contained in the results is de-identified; Other circumstances stipulated by laws and regulations. Please understand that the functions and services we provide to you are constantly updated and developed, if a function or service is not in the above description and collect your information, we will separately explain the content, scope and purpose of information collection to you through the page prompts, interactive processes, announcements and other ways, in order to obtain your consent. Please note that in order to better provide you with recharge, share and message push functions, GeoProof Camera we will be in [the third party information sharing app list] (https://www.notion.so/15b890eb9b7c80b7b19cc6847c3307d0?pvs=21) listed in the circumstances, and provide the relevant functions of the third party to share information. In addition, we do not obtain your personal information from third parties outside of the GeoProof Camera app platform and the list. If we need to obtain other personal information from a third party indirectly for future business development, we will inform you of the source, type and scope of use of the personal information before obtaining it. If the personal information processing activities we need to conduct business exceed the scope of your authorization and consent when you originally provided personal information to a third party, we will obtain your authorization and consent before processing such personal information; In addition, we will strictly comply with relevant laws and regulations, and require third parties to ensure the legality of the information they provide. 2. Storage of information2.1 Method and duration of information storage We store your information in a secure way, including local storage (e.g. data caching with apps), databases and server logs. In general, we will only store your personal information for the time necessary to achieve the purpose of the service or under the conditions stipulated by laws and regulations. 2.2 Location of information storage We will store the personal information collected in China in accordance with laws and regulations. We do not currently transfer or store your personal information across borders. In the future, if cross-border transmission or storage is required, we will inform you of the purpose of the information, the recipient, security assurance measures and security risks, and obtain your consent. 2.3 Notification when the product or service ceases operation When our products or services stop operation, we will notify you in the form of push notifications, announcements, etc., and delete your personal information or anonymize it within a reasonable period of time, except as otherwise provided by laws and regulations. 3. Information security3.1 Security Protection Measures We strive to provide security for users’ information to prevent information disclosure, loss, improper use, unauthorized access and disclosure. We use multi-dimensional security protection measures to ensure that users’ personal information protection is at a reasonable level of security, including technical protection means, management system control, security system protection and many other aspects. We use industry-leading technology protection measures. The technical means we use include, but are not limited to, firewalls, encryption (such as SSL), de-identification or anonymization, access control measures, etc. In addition, we continuously enhance the security capabilities of the software installed on your device. For example, we encrypt some information locally on your device to ensure secure transmission. We will know the application information installed on your device and the process information running in order to prevent viruses, Trojans and other malicious programs. We have established a special management system, process and organization to ensure the security of personal information. For example, we strictly limit the scope of people who can access information, require them to comply with confidentiality obligations and conduct audits, and those who violate their obligations will be punished according to regulations. We also review our systems, processes, and organizations to prevent unauthorized access, use, or disclosure of user information. We recommend that you pay full attention to the protection of personal information when using products and services, and we will provide a variety of security features to help you protect your personal information security. 3.2 Security Incident Handling Measures ** In case of personal information leakage, damage, loss and other security incidents, we will initiate emergency plans to prevent the expansion of security incidents. After the occurrence of a security incident, we will promptly inform you of the basic situation of the security incident, the disposal measures and remedial measures we will take or have taken, as well as our response suggestions to you in the form of push notifications, emails, etc. If it is difficult to inform one by one, we will issue warnings through announcements and other means. 4. How do we use informationWe strictly abide by the provisions of laws and regulations and the agreement with users, in accordance with this privacy guidelines to use the collected information, in order to provide you with better services. 4.1 Information Usage Rules ** We use the information we collect in accordance with the following rules: We will analyze the operation of our products according to the frequency and situation of your use of Engraving Time app, fault information, performance information, etc., to ensure the safety of the service, and optimize our products and improve the quality of our service. We do not combine the information we store in our analytics software with the personally identifiable information you provide. In order to make you have a better experience, improve our services or other purposes with your consent, under the premise of complying with relevant laws and regulations, we may use the information collected through GeoProof Camera app for our other services. For example, information about your use of one of our services may be used for services such as user research analysis and statistics. 4.2 Means of obtaining consent after notification of purpose of change * We will use the information we collect for the purposes covered in this Privacy Guideline. If we use your personal information beyond the scope that is directly or reasonably related to the purpose stated at the time of collection, we will inform you again and obtain your express consent before using your personal information. 5. Provide ExternallyCurrently, we share some of your data, such as Android users’ ** device identifier ** (OAID only), with third party partners such as advertisers and their agents for the purpose of serving ads, evaluating, optimizing the effectiveness of advertising, or based on reasonable business practices. However, we will require third-party partners to strictly comply with our measures and requirements on data privacy protection, including but not limited to processing in accordance with the data protection agreement, commitment letter and relevant data processing policy, to avoid identification of individuals, to ensure privacy security. GeoProof Camera we will be in [the third party information sharing app list] (https://www.notion.so/15b890eb9b7c80b7b19cc6847c3307d0?pvs=21) listed in the circumstances, and provide the relevant functions of the third party to share information, In addition, we will not actively share or transfer your personal information to third parties, and if there is other sharing, we will obtain your express consent. If you want us to share your personal information with third parties, you can make a request to us through the contact details in Section 10, and we will respond within 15 days of receiving your request. We will not publicly disclose the collected personal information to the outside world, if it is necessary to disclose publicly, we will inform you of the purpose of public disclosure, the type of information disclosed and the sensitive information that may be involved, and obtain your express consent. As our business continues to develop, we may engage in mergers, acquisitions, asset transfers and other transactions, and we will inform you of the relevant circumstances, in accordance with laws and regulations and no less than the standards required by this privacy protection Guidelines to continue to protect your personal information or require a new controller to continue to protect your personal information. In addition, according to relevant laws and regulations and national standards, we may share, transfer, and publicly disclose personal information without prior authorization from you under the following circumstances: Directly related to national security and national defense security; Directly related to public safety, public health or major public interests; Directly related to criminal investigation, prosecution, trial and enforcement of sentences; In order to protect the life, property and other major legitimate rights and interests of the personal information subject or other individuals, but it is difficult to get the consent of the person; The personal information subject discloses personal information to the public on its own; Collecting personal information from legally publicly disclosed information, such as legal news reports, government information disclosure and other channels. 6. Your RightsDuring your use of the GeoProof Camera app, in order to make it more convenient for you to query access, copy, delete and correct your personal information, while protecting your right to withdraw your consent to the use of personal information and cancel your account, we provide you with the corresponding operation Settings in the product design, you can refer to the following guidelines for operation. In addition, we have set up a complaint channel, and your comments will be dealt with in a timely manner. 7. ChangeWe may revise this Privacy Policy from time to time. When the terms of the Privacy Protection Guidelines are changed, we will remind you of the changed privacy protection Guidelines by means of red dots when the version is updated, and explain the effective date to you. Please read the changed privacy Protection guidelines carefully. Your continued use of the app means that you agree that we process your personal information in accordance with the updated privacy protection Guidelines. 8. EULAhttps://www.apple.com/legal/internet-services/itunes/dev/stdeula/ 9. Subscription&amp;Auto-Renewal Service:Auto-Renewal Service: When subscribing to [GeoProof Camera]: Payment Processing Apple acts as payment processor We receive transaction receipts without sensitive payment details Renewal Terms Auto-renews 24 hours before subscription period ends Charged to your Apple ID account Cannot disable auto-renewal during active billing period Subscription ManagementS Access via:Settings → Apple ID → Subscriptions → [GeoProof Camera] Service continues until period ends after cancellation Data Retention Subscription records kept for 24 months for tax compliance Device identifiers anonymized after subscription termination Subscription Plans: Plan Duration Price (USD) Renewal Cycle Basic 1 Month $6.99 Monthly Premium 1 Year $69.99 Yearly Key Conditions: Price Changes Price adjustments notified via email 30 days in advance Must cancel before effective date to avoid new charges Free Trials Converts to paid subscription automatically after trial Cancel during trial for no charge Refund Policy Follows Apple standard refund terms: Refund requests accepted within 14 days of purchase Full refund for unused services Service Termination Account abuse results in immediate termination without refund 30-day notice before bankruptcy/service discontinuation 10. Contact us“We” in this Agreement refers to the operator and developer of the Engraving Time app, which is operated by Yantai Jingao New Energy Technology Co., LTD. We have set up a special personal information protection team and personal information protection person in charge. If you have any questions or complaints or suggestions regarding this privacy policy or personal information protection, you can contact us through the following ways: Contact operator: Yantai Jingao New Energy document.querySelectorAll('.github-emoji') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });","categories":[],"tags":[],"author":null},{"title":"Privacy & Legal","slug":"Snapwow Privacy&Legal","date":"2024-12-22T06:49:36.000Z","updated":"2024-12-22T06:49:36.000Z","comments":true,"path":"2024/12/22/snapwow-privacy-legal/","link":"","permalink":"http://allensucre.github.io/2024/12/22/snapwow-privacy-legal/","excerpt":"","text":"Snapwow Privacy &amp; LegalUpdated: May 30, 2024 Effective date: May 30, 2024 Snapwow IntroductionWelcome to the Snapwow APP! We will help you understand our collection, use, storage and sharing of personal information through the Privacy Protection Guidelines, as well as your rights. Snapwow takes user privacy very seriously. When you use our services, we may collect and use information about you. We would like to use this Privacy Protection Guide to explain to you how we collect, use, store and share this information when using our services, and how we provide you with access to, update, control and protect this information. This guide is closely related to the engraving time APP service you use, I hope you read it carefully, and make the choice you think appropriate in accordance with this guide when necessary. By using or continuing to use our Services, you consent to the collection, use, storage and sharing of your information in accordance with this Privacy Protection Guideline. This privacy guide will help you understand the following: Collection of personal information ** Storage of information 3, information security 4, How do we use information 5, external provide 6, Your rights 7, change Protection of minors 9, other 10, Contact us 1. Information we collectSculpting Time app is a photo application. In the process of your use of the Sculpting Time app service, we will collect the information you proactively provide when using the service or generated because of the use of the service in the following ways to provide you with services, optimize our services and protect your account security: When you use the Engraving app service, in order to protect your normal use of our service, maintain the normal operation of our service, improve and optimize our service experience, and protect the security of your account, we will collect your device model, unique device identifier (AndroidID), application list, Used to identify you as a Snapwow app user and protect business security. In order to ensure your normal use of our services, maintain the normal operation of our services, improve and optimize your service experience, and ensure the security of your account, we will collect your device model, operating system, unique device identifier, login IP address, operation log, SSID, BSSID, network information, device SN and other information. To prevent your data from being frequently invoked, we collect your SDK or API version, platform, timestamp, application identifier, application version, terminal manufacturer, terminal device operating system version, local language, time zone, network status (Wi-Fi status, etc.), and network log information to ensure the minimum use of your information. We or our third-party partners may collect your information through cookies, identifiers and related technologies, including your device information, browsing information, and click information, and store such information as log information to provide you with a quality user experience and ensure the security of the service. You can disable or manage the use of cookies, identifiers, or related technologies by setting them. At the same time, in order to ensure the stable operation of the Snapwow app or achieve relevant functions, we may access software development kits (SDKS) provided by third parties to achieve the above purposes. Snapwow app access to third party SDK directory/see this link (https://www.notion.so/15b890eb9b7c80b7b19cc6847c3307d0?pvs=21). When you use iOS devices to take photos or shoot videos, we will ask you to authorize ** camera permissions, microphone permissions, album permissions *, in order to provide you with picture and video shooting, sound recording, picture and video reading, save and other functions. In order to provide you with better services and content, we will track your activities on other companies’ apps and websites with your consent. You can turn off the above permissions at any time. When you use your Android device, we do not use your camera permissions * and microphone permissions . In addition, according to relevant laws and regulations and national standards, we may collect and use your relevant personal information without seeking your authorization and consent under the following circumstances: Directly related to national security, national defense security and other national interests; Directly related to public security, public health, public knowledge and other major public interests; Directly related to criminal investigation, prosecution, trial and enforcement of sentences; For the protection of your or other individuals’ life, property, reputation and other major legitimate rights and interests, but it is difficult to get the consent of the person; The personal information collected is disclosed to the public by you; Collecting personal information from legally publicly disclosed information, such as legal news reports, government information disclosure and other channels; Necessary for the conclusion and performance of the contract at your request; Necessary to maintain the safe and stable operation of the products or services provided, such as detecting and disposing of faults of the products or services; necessary for the conduct of legitimate journalism; When statistical or academic research is necessary in the public interest, and the results of academic research or description are provided to the public, the personal information contained in the results is de-identified; Other circumstances stipulated by laws and regulations. Please understand that the functions and services we provide to you are constantly updated and developed, if a function or service is not in the above description and collect your information, we will separately explain the content, scope and purpose of information collection to you through the page prompts, interactive processes, announcements and other ways, in order to obtain your consent. Please note that in order to better provide you with recharge, share and message push functions, Snapwow we will be in [the third party information sharing app list] (https://www.notion.so/15b890eb9b7c80b7b19cc6847c3307d0?pvs=21) listed in the circumstances, and provide the relevant functions of the third party to share information. In addition, we do not obtain your personal information from third parties outside of the Snapwow app platform and the list. If we need to obtain other personal information from a third party indirectly for future business development, we will inform you of the source, type and scope of use of the personal information before obtaining it. If the personal information processing activities we need to conduct business exceed the scope of your authorization and consent when you originally provided personal information to a third party, we will obtain your authorization and consent before processing such personal information; In addition, we will strictly comply with relevant laws and regulations, and require third parties to ensure the legality of the information they provide. 2. Storage of information2.1 Method and duration of information storage We store your information in a secure way, including local storage (e.g. data caching with apps), databases and server logs. In general, we will only store your personal information for the time necessary to achieve the purpose of the service or under the conditions stipulated by laws and regulations. 2.2 Location of information storage We will store the personal information collected in China in accordance with laws and regulations. We do not currently transfer or store your personal information across borders. In the future, if cross-border transmission or storage is required, we will inform you of the purpose of the information, the recipient, security assurance measures and security risks, and obtain your consent. 2.3 Notification when the product or service ceases operation When our products or services stop operation, we will notify you in the form of push notifications, announcements, etc., and delete your personal information or anonymize it within a reasonable period of time, except as otherwise provided by laws and regulations. 3. Information security3.1 Security Protection Measures We strive to provide security for users’ information to prevent information disclosure, loss, improper use, unauthorized access and disclosure. We use multi-dimensional security protection measures to ensure that users’ personal information protection is at a reasonable level of security, including technical protection means, management system control, security system protection and many other aspects. We use industry-leading technology protection measures. The technical means we use include, but are not limited to, firewalls, encryption (such as SSL), de-identification or anonymization, access control measures, etc. In addition, we continuously enhance the security capabilities of the software installed on your device. For example, we encrypt some information locally on your device to ensure secure transmission. We will know the application information installed on your device and the process information running in order to prevent viruses, Trojans and other malicious programs. We have established a special management system, process and organization to ensure the security of personal information. For example, we strictly limit the scope of people who can access information, require them to comply with confidentiality obligations and conduct audits, and those who violate their obligations will be punished according to regulations. We also review our systems, processes, and organizations to prevent unauthorized access, use, or disclosure of user information. We recommend that you pay full attention to the protection of personal information when using products and services, and we will provide a variety of security features to help you protect your personal information security. 3.2 Security Incident Handling Measures ** In case of personal information leakage, damage, loss and other security incidents, we will initiate emergency plans to prevent the expansion of security incidents. After the occurrence of a security incident, we will promptly inform you of the basic situation of the security incident, the disposal measures and remedial measures we will take or have taken, as well as our response suggestions to you in the form of push notifications, emails, etc. If it is difficult to inform one by one, we will issue warnings through announcements and other means. 4. How do we use informationWe strictly abide by the provisions of laws and regulations and the agreement with users, in accordance with this privacy guidelines to use the collected information, in order to provide you with better services. 4.1 Information Usage Rules ** We use the information we collect in accordance with the following rules: We will analyze the operation of our products according to the frequency and situation of your use of Engraving Time app, fault information, performance information, etc., to ensure the safety of the service, and optimize our products and improve the quality of our service. We do not combine the information we store in our analytics software with the personally identifiable information you provide. In order to make you have a better experience, improve our services or other purposes with your consent, under the premise of complying with relevant laws and regulations, we may use the information collected through Snapwow app for our other services. For example, information about your use of one of our services may be used for services such as user research analysis and statistics. 4.2 Means of obtaining consent after notification of purpose of change * We will use the information we collect for the purposes covered in this Privacy Guideline. If we use your personal information beyond the scope that is directly or reasonably related to the purpose stated at the time of collection, we will inform you again and obtain your express consent before using your personal information. 5. Provide ExternallyCurrently, we share some of your data, such as Android users’ ** device identifier ** (OAID only), with third party partners such as advertisers and their agents for the purpose of serving ads, evaluating, optimizing the effectiveness of advertising, or based on reasonable business practices. However, we will require third-party partners to strictly comply with our measures and requirements on data privacy protection, including but not limited to processing in accordance with the data protection agreement, commitment letter and relevant data processing policy, to avoid identification of individuals, to ensure privacy security. Snapwow we will be in [the third party information sharing app list] (https://www.notion.so/15b890eb9b7c80b7b19cc6847c3307d0?pvs=21) listed in the circumstances, and provide the relevant functions of the third party to share information, In addition, we will not actively share or transfer your personal information to third parties, and if there is other sharing, we will obtain your express consent. If you want us to share your personal information with third parties, you can make a request to us through the contact details in Section 10, and we will respond within 15 days of receiving your request. We will not publicly disclose the collected personal information to the outside world, if it is necessary to disclose publicly, we will inform you of the purpose of public disclosure, the type of information disclosed and the sensitive information that may be involved, and obtain your express consent. As our business continues to develop, we may engage in mergers, acquisitions, asset transfers and other transactions, and we will inform you of the relevant circumstances, in accordance with laws and regulations and no less than the standards required by this privacy protection Guidelines to continue to protect your personal information or require a new controller to continue to protect your personal information. In addition, according to relevant laws and regulations and national standards, we may share, transfer, and publicly disclose personal information without prior authorization from you under the following circumstances: Directly related to national security and national defense security; Directly related to public safety, public health or major public interests; Directly related to criminal investigation, prosecution, trial and enforcement of sentences; In order to protect the life, property and other major legitimate rights and interests of the personal information subject or other individuals, but it is difficult to get the consent of the person; The personal information subject discloses personal information to the public on its own; Collecting personal information from legally publicly disclosed information, such as legal news reports, government information disclosure and other channels. 6. Your RightsDuring your use of the Snapwow app, in order to make it more convenient for you to query access, copy, delete and correct your personal information, while protecting your right to withdraw your consent to the use of personal information and cancel your account, we provide you with the corresponding operation Settings in the product design, you can refer to the following guidelines for operation. In addition, we have set up a complaint channel, and your comments will be dealt with in a timely manner. 7. ChangeWe may revise this Privacy Policy from time to time. When the terms of the Privacy Protection Guidelines are changed, we will remind you of the changed privacy protection Guidelines by means of red dots when the version is updated, and explain the effective date to you. Please read the changed privacy Protection guidelines carefully. Your continued use of the app means that you agree that we process your personal information in accordance with the updated privacy protection Guidelines. 8. EULAhttps://www.apple.com/legal/internet-services/itunes/dev/stdeula/ 9. Subscription&amp;Auto-Renewal Service:Auto-Renewal Service: When subscribing to [Snapwow]: Payment Processing Apple acts as payment processor We receive transaction receipts without sensitive payment details Renewal Terms Auto-renews 24 hours before subscription period ends Charged to your Apple ID account Cannot disable auto-renewal during active billing period Subscription ManagementS Access via:Settings → Apple ID → Subscriptions → [Snapwow] Service continues until period ends after cancellation Data Retention Subscription records kept for 24 months for tax compliance Device identifiers anonymized after subscription termination Subscription Plans: Plan Duration Price (USD) Renewal Cycle Basic 1 Month $6.99 Monthly Premium 1 Year $69.99 Yearly Key Conditions: Price Changes Price adjustments notified via email 30 days in advance Must cancel before effective date to avoid new charges Free Trials Converts to paid subscription automatically after trial Cancel during trial for no charge Refund Policy Follows Apple standard refund terms: Refund requests accepted within 14 days of purchase Full refund for unused services Service Termination Account abuse results in immediate termination without refund 30-day notice before bankruptcy/service discontinuation 10. Contact us“We” in this Agreement refers to the operator and developer of the Engraving Time app, which is operated by Yantai Jingao New Energy Technology Co., LTD. We have set up a special personal information protection team and personal information protection person in charge. If you have any questions or complaints or suggestions regarding this privacy policy or personal information protection, you can contact us through the following ways: Contact operator: Yantai Jingao New Energy document.querySelectorAll('.github-emoji') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });","categories":[],"tags":[],"author":null},{"title":"Team Introduction","slug":"TeamIntroduction","date":"2020-12-24T06:49:36.000Z","updated":"2020-12-24T06:49:36.000Z","comments":true,"path":"2020/12/24/teamintroduction/","link":"","permalink":"http://allensucre.github.io/2020/12/24/teamintroduction/","excerpt":"","text":"Team IntroductionTeam IntroductionOur team consists of experienced developers from top-tier internet companies, bringing a wealth of technical expertise and sharp market insights. When developing each product, we adhere to a spirit of excellence, aiming to solve real-world problems through innovative technology and user-centered design. We focus not only on the technical implementation of our products but also on the user experience and market feedback, striving to deliver products that bring genuine value to our users. document.querySelectorAll('.github-emoji') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });","categories":[],"tags":[],"author":null},{"title":"Product Introduction","slug":"ProductIntroduction","date":"2020-12-23T06:49:36.000Z","updated":"2020-12-23T06:49:36.000Z","comments":true,"path":"2020/12/23/productintroduction/","link":"","permalink":"http://allensucre.github.io/2020/12/23/productintroduction/","excerpt":"","text":"Product IntroductionSnapWow SnapWow is an innovative watermark camera app designed to help users automatically add multi-dimensional information such as time, location, and weather to their photos. With its intelligent watermark feature, users can capture the unique context of each moment, turning every photo into a connection to time and memories. SnapWow’s clean, intuitive design aims to provide a smooth shooting experience while enriching the depth and emotional value of photo documentation. -– LinkFans LinkFans is a Linktree tool designed specifically for the image domain, allowing users to quickly and conveniently integrate multiple image links into a beautiful personal homepage. Whether it’s showcasing a portfolio, social media links, or other image content, LinkFans offers a clear and organized display platform that helps users enhance their personal brand influence and online presence. document.querySelectorAll('.github-emoji') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });","categories":[],"tags":[],"author":null},{"title":"Our Vision","slug":"OurVision","date":"2020-12-22T06:49:36.000Z","updated":"2020-12-22T06:49:36.000Z","comments":true,"path":"2020/12/22/ourvision/","link":"","permalink":"http://allensucre.github.io/2020/12/22/ourvision/","excerpt":"","text":"Our VisionOur VisionWe are committed to enhancing users’ digital life experiences through technological innovation and design-driven solutions. Our vision is to create a series of easy-to-use, creative tools that help users capture moments, showcase themselves, and connect with the world. Whether for individual users or business clients, we aim to empower them through our products, enabling everyone to freely express themselves and create in the digital age. document.querySelectorAll('.github-emoji') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });","categories":[],"tags":[],"author":null}],"categories":[],"tags":[]}